---
kind: property
id: P:Autodesk.Revit.DB.ConnectorManager.UnusedConnectors
source: html/1cb54fcb-75c5-d09b-f4c3-026146fbd455.htm
---
# Autodesk.Revit.DB.ConnectorManager.UnusedConnectors Property

Return all the unused Connectors of the Connector Manager.

## Syntax (C#)
```csharp
public ConnectorSet UnusedConnectors { get; }
```

## Remarks
This property is used to retrieve the unused Connectors from the Connector Manager.